app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "New 1"], ["description", "New 1"], ["created_at", "2019-07-21 18:27:48.670346"], ["updated_at", "2019-07-21 18:27:48.670346"]]
---
	def create
	  @post = Post.new(params)
	  @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "description" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["description", "testing update"], ["updated_at", "2019-08-01 20:32:18.655501"], ["id", 1]]
---
	def update
	  @post = Post.find(params[:id])
	  @post.update(params.require(:post).permit(:title, :description, :author_id))